#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
azuread_group.k8s_administrators: Refreshing state... [id=f453d3b2-44fe-4359-83cc-1328bcf53d27]
azurerm_resource_group.k8s_rg: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourceGroups/demo-k8s-rg]
azurerm_log_analytics_workspace.k8s_monitor: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/microsoft.operationalinsights/workspaces/demo-k8s-monitor]
azurerm_user_assigned_identity.k8s_uami: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/demo-k8s-uami]
azurerm_storage_account.k8s_storage: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourceGroups/demo-k8s-rg/providers/Microsoft.Storage/storageAccounts/demok8sstorage]
azurerm_kubernetes_cluster.k8s_cluster: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s]
azurerm_kubernetes_cluster_node_pool.k8s_nodepool_dev: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s/agentPools/devtest]
azurerm_storage_container.k8s_backup: Refreshing state... [id=https://demok8sstorage.blob.core.windows.net/demobackup]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.k8s_cluster must be replaced
-/+ resource "azurerm_kubernetes_cluster" "k8s_cluster" {
      - api_server_authorized_ip_ranges = [] -> null
      - enable_pod_security_policy      = false -> null
      ~ fqdn                            = "demo-k8s-40bd920d.hcp.southeastasia.azmk8s.io" -> (known after apply)
      ~ id                              = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s" -> (known after apply)
      ~ kube_admin_config               = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUUvVENDQXVXZ0F3SUJBZ0lSQVBielhONWpwQU10MzBReXNvdE02MUF3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdIaGNOTWpBeE1qQTFNVGt4TnpFMVdoY05Nakl4TWpBMU1Ua3lOekUxV2pBdwpNUmN3RlFZRFZRUUtFdzV6ZVhOMFpXMDZiV0Z6ZEdWeWN6RVZNQk1HQTFVRUF4TU1iV0Z6ZEdWeVkyeHBaVzUwCk1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBcTdLb1I2dEtIQzRsNnFuUjVra3oKS1M3NzBqK0pPRVJkV1B2SWhxVWVWZjJQWmpoNFRXVjhCdXJ3ODJaelBrd1U5a21GTE52WGFLWWdhb2E5bW5xNApLUThVcHlQOE05dVNZT2daYkxZUS9XOFpiK2dTTkRmK0RWRkQ1eXN5RkphNmhNdkhVbG8zMFBNWEc0NjkwR2xIClJOd2IwbXVueVFmVE80blNkZllmTnlBbncyU2w2eXQrWU81MjlEWU4vWHJES3JHcUMyZjVLcjhWYklHTHFObkQKeUJXTDdVS3BPY2dvNU5BVFl2d1ZYWTNOU1pDOXhVTW13U3lTcG9la1VMc3Iwa3J1RTJDeVdHUkRmN1hpWS9XUApTMmNBQnNXNE96eWtwSW4vakpDUm5GQi92b3ZrUnAxQWFhRjN6dFBsN2daNnVlU2x2YkRDWkhINDFMY1ptM2JoClJvTHNFazRvQzlwZVkrUUUyZ1B2MkF1Tk9sRjdNNXdoYlNRZ0xZdDBKcm1JRjdlUWdCVlJOZFFrSng1R2szZmEKYXM0dGtCelYxR1pmbEdlaE1YeUM2OUQrWGpDNk8ycGhnaktsR1dLTFFLVkc3V25oYW1yVUNyV1NtMkZDL0V2UgpyL1dSNmZhM09qN2RVcWZOQlp3N2tsSTZNU3BCVVE1VDdTaUZuU0kwM2tRQzFuYTdQOWtEaExscGU1RWZTU0xxCmQydmkzZXlpN0xidVhpYWtTT0w3eDcrUzRGRldxK0lsRXNRWHBmL2VaZTIzS0k2Um54RGY2c3hQMnNmK0NYTW4KSjJIcVRsS2dhWVBqSnR2R1lybm0vZkxQQW5ZQjRmZ2FiQTZ0c3BERDVEM3hOZ1BDTFhoOUVncHo1UU9lN3Nzegp3ZmdDYlBNSjhNVGkxOHJiZHRRNUtSVUNBd0VBQWFNMU1ETXdEZ1lEVlIwUEFRSC9CQVFEQWdXZ01CTUdBMVVkCkpRUU1NQW9HQ0NzR0FRVUZCd01DTUF3R0ExVWRFd0VCL3dRQ01BQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUIKQUEvWGlNRjgzVTZWbnNRUW00U0s1Vi9MUXZLNjdhbnYwMkxGZ3VBRjY4U1BobWRYcTNBNXFPNXhJb2JCY3ZIKwpGQU5GQUd4NjhKR1dBRG1jZ3JwaDVKVThsSzk2dnk0bWNVU0QwQjRteVZFeTVyL0JTa3F2K3BnRDVob25taU9UCjJub2pqK1hUbTYrN2RaUE9RVHpRU2pvRkFrQm1ReE1KbmdldUNUWFhmekg4UTI5bWM4N1lMSzB1R085MUFrbk0KcTF2NkhPcUZZODkzSVlSUVRmMnBZK01JRUJBeUtzb0U4cEREMGQ5QmxyTXkxdHIrdUI0WEZ1em16THFpNElwMApJcUhlM3QrMmNLYmQ2YloxN0ZsZTBHZWFYYzI1bWdvNlhtdzN6ZUw3VnlZYmw1VzRSK3BCdndJRWNuVmVKVnY2Cm9CR2lObnpmK2FsMmxnYXZRcFB3RUhicU1hME9TejNnV00yZmpyMnl6UnJGWE1WN2JrZnNxMHljRjRTcld3azQKenorZkl4aFhPTDYwNlM4aS85dHpTekNCMUxXM2NETDhCZlJHWEpHQ2tNRzUwaUNlN280VU5yMkZtOTdlcnk4YgpSc21BZWRxUG9CK0FVYUdMYUdtd0Fja3gxRXdpN1lFejV0MGNMYmxDZnVrYzFiay81QmFHZE51TG9zcXNUbkhoCjJQa3ZXTmRva1JmYXJXUzd2aXdndFNHaEVQeFZnNXJYYlpqMWhnaXdvMnBhd3hnNWJQNWxVbnk2anRqbzkrZjUKZHVzOWx6anNyTVE3Q0crbUlGZkNia0FVOFIzMktwc1ljWXVZVDNIejdjOWw3bjZiWEQvRlB5MTFHNkNIQnI4ZQpnTUlVbzhxK0g5empmeGFBaEpPRlNOQ2cweGpRRzArSDdpWm1QT2FCOFV1KwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKSndJQkFBS0NBZ0VBcTdLb1I2dEtIQzRsNnFuUjVra3pLUzc3MGorSk9FUmRXUHZJaHFVZVZmMlBaamg0ClRXVjhCdXJ3ODJaelBrd1U5a21GTE52WGFLWWdhb2E5bW5xNEtROFVweVA4TTl1U1lPZ1piTFlRL1c4WmIrZ1MKTkRmK0RWRkQ1eXN5RkphNmhNdkhVbG8zMFBNWEc0NjkwR2xIUk53YjBtdW55UWZUTzRuU2RmWWZOeUFudzJTbAo2eXQrWU81MjlEWU4vWHJES3JHcUMyZjVLcjhWYklHTHFObkR5QldMN1VLcE9jZ281TkFUWXZ3VlhZM05TWkM5CnhVTW13U3lTcG9la1VMc3Iwa3J1RTJDeVdHUkRmN1hpWS9XUFMyY0FCc1c0T3p5a3BJbi9qSkNSbkZCL3ZvdmsKUnAxQWFhRjN6dFBsN2daNnVlU2x2YkRDWkhINDFMY1ptM2JoUm9Mc0VrNG9DOXBlWStRRTJnUHYyQXVOT2xGNwpNNXdoYlNRZ0xZdDBKcm1JRjdlUWdCVlJOZFFrSng1R2szZmFhczR0a0J6VjFHWmZsR2VoTVh5QzY5RCtYakM2Ck8ycGhnaktsR1dLTFFLVkc3V25oYW1yVUNyV1NtMkZDL0V2UnIvV1I2ZmEzT2o3ZFVxZk5CWnc3a2xJNk1TcEIKVVE1VDdTaUZuU0kwM2tRQzFuYTdQOWtEaExscGU1RWZTU0xxZDJ2aTNleWk3TGJ1WGlha1NPTDd4NytTNEZGVwpxK0lsRXNRWHBmL2VaZTIzS0k2Um54RGY2c3hQMnNmK0NYTW5KMkhxVGxLZ2FZUGpKdHZHWXJubS9mTFBBbllCCjRmZ2FiQTZ0c3BERDVEM3hOZ1BDTFhoOUVncHo1UU9lN3NzendmZ0NiUE1KOE1UaTE4cmJkdFE1S1JVQ0F3RUEKQVFLQ0FnQnF1N0RvZkk2aFhmNnNGYzBwdnE5VEZxWHNXUnJRSTQ5ejFYRWVZbDZ0VGVacXdRZm45UUpZdW92MgpndVY1QUlxM1g1U3VBaXV5SGpOZ2hVb3dVY0ZScE5KTjVJelBIOXVxNmgyRCt0b3M4WGQ2bldWVG1Nc1JORWRsCjJQQlU1QzRtaHhidEZyQkQ4Qm1aUSs2ek0vN2R5NFp3RkFSRmI5dmIweDFGdnk1QWNuakZlamU2TFZ0dW5rN00KR1I0eFNMTXlReWRWMTlpSXZpaHZQMGkyT2tqK2hJWnJnMWozVm5vMVl6UHFBSkszaVlMb0RGWXIza2FsSnpReQoyWGRIeUZMQmMxcjBLTlExSm43ZlVRM2UzYk9xUitrNFRJanVLaENmU0RuWUE3YkEyVG5RRmQ1ZUZ6c0hieHl2Ck1nSnBLUlg1b1MxMjhmNmx1a1BZMThuUFh1TkNrVTZwZHdVT0pNUThGUnIzZTd3UXJNSTNURDZCTnAwVnhDcEQKalp2ODEyUGNQV2dsNVp5bG1FTHUyVkViVDR3dzVlV3VBTWxydmZVWTVhUVBaejMxOVdNdGc5cVVMcWpQSDNEOQpRVE1TNlFKNkc1NWVKZ29vTUFjQ29DeVdEbzdmbjBEYWF4VUVoRTViSkFaUDdhSStJbnl0YmN6VHpZN2puSm1TCkRYdldGcGUwdS84bVNSS2ZVcnRIUXk3SEt6cWJTMHg2RktKSVFBSC9RSFQ1YzcyVDVmQnNRajlzWkZSMDlUeGwKTkI1cnp4UXQxaUl1VHZVU2hxc2prVkpxYmR1WE1OVWIxN0hNbTZVRURsYjRSNXJWbXZOMllBK1V5MzFnTk9uWQp2RXh2TTlCSTA0S3BMd1hBUGM4ayt6aXR4M1pIdW4vVWVsOWo4OU9XS1kzSWNwZExBUUtDQVFFQTBzbzVlRThTCjEvcHNrWkRvcVVlZVpwWHhoRDZCWUY0YWZqSmVCWkMxUjUyWlpPSjNoRkZveUhvNDh3dGVraFcvcTRnbmVUWHAKSjMweU5hb3d6MGh0Rm5LaHBwNkRKUm5hVEk5WlRhT1Uwci8wMjk5cnUxM2FRRkRob0VkK3JYWFNLbmVnNGY5MApxUng1TU00a3k5ckovRXpZMUs1SDVCa204NEp1Tlk5R0g5MlZlMEt3NVBiQ3hYWUc4MU1RN002SDhuSmVlWXZWCklnZExOc2FLUVNUSGZBRkxSYXVoS0l3Vis4dmRpN25xRXk0cVlRZGlKa2x5bkpGWVFWeFdQOHp0ZDVsemJNazMKa1JRY01ZNXN4azF4dXhrYjlYRUl0SWtFNnd4a1dTeG4yTWoxU3hkRXN6WmQrU0ozSTc3UHVERW5aUWhtZXcraQpLTmJlbjhJWC9OaWpzUUtDQVFFQTBJWUVpTmZjQkdsVzg4enF3SFRzRENid28wYUR6VlNaekNpNmxocDVNTUw3CnlmZlZqbkhSZlI2d0lsVnhrYjY3M0xSUWZucVFvMHNhYXVPK0g2SnJ0S0hKYWlrK0FaWEtGSzgrMHQrTlNHYlUKSzlQVi9VQ3BzaEEzMWd6cm5WOXIvbXpreXV6UEp6RUh6SDdxaXFQUnJtam94UUkvaEZqSE1NaEdlMW45cTl6Kwp0QU5LRG8vQ1B2emVYbmhIYmpsMEJqOUdYR3FJNXFjVnZKYmdpT2w2UDBUQmZod2JrU1pwKzcwbTFSY3dGbHRFClBWLzd0WUdzYXkyUlFJcjBVdHZxajdvM2ZYaENJRmZhZGNTWmlnTmlOTEFKSGJrQ1VMTXZyVTZHam0wQ3lscWUKalRaaEIvRGZPaXFUL1V4U1A0eU12cmJlOTcxajdkQlhNUFMyQ0VRb3BRS0NBUUFQQXIyaTlxYVY0TXg0ZFVSTQpRY0JpOTh5U0tVMVhTbnhDZmwyNXNidG5GUzhHUXlaVnN1SnVYRjNQMlFCc0VNWnNkYTZ4OEFmaGV3WG5VbTVWClpJZjRNRU9ZdFBNTDRsSnNYMHp4dlhOc3FxVEtQNWZSYVBhUTIvR2xVMUlQRWpQY09GYXBvV0p5WklldzFRMUQKd3huZE1LL0VQWUQ3R2x0dXZkd1JUbG1sRFVlRzFwSDRUQ1pFbjRvUks5b3BzdTkxY1hXTzNFbGFPZ0MrTHRkTAptazNtWThVemVleHBFY2pDL0pxVFI3TUdtS1FGOHR1bmRGV0lGc1dkS2ZFdWErNkJOTmxHWnZIaEQvaU9BdUYyCklhKzJyaXdTaDNFaVFodXFqV0JjQlZDRDNKT3pQRDMxTVNyeUFlVlFFMWVCZTJhZHlFSmNBeG4rSkljSUEyOW4KM3htUkFvSUJBRnJhS1Z1ZUFTU0M2UG1zVEpPeDNhNmx3SzdDNkdZcitCNTFtR1lSL3I5NkZNNDRodmxiS2RVRAo2K1hwcUdQQjRJUVdwQU9YVHpGMlpYb3c1QU5RZHZEcWxLRUdleGVodGJ3eFpvUG1GdDUydnZhaGcxaW1OY2w1Ck8zcXRnbks4d29iRjF5RjY3LzY1WkJaN0xhRmVJdHVFcGZaQU5vQnBWZEF4VWxRb0wxZ1VIMzA2K2FkQ2gzVisKSXp5eDF4MTFOdElKKzVRRWJzVmdBeDU1OWpadzAyeUJmblI5dHAwVlNaUC9JODR3SGlsL2RrbnZhZkg1SDdCSwoyRUJ3eW1iWG5ta2t6MHlCZXY0d2lPUksxa0xGbXFJdUdLcTBrd2VxS3BtdDN2NXJESTR4MFdiaFRJRnpOeTlXCm9jZjQydFVKWGNFeVdBOUVteWRnWUx6WndmMzBCR2tDZ2dFQVZkVzRDaU9HeTZsbVNKYVlPL21MZEdCeXA3YkgKbURycHp1ZC83WnVRaEhuRUVlanVOUXZMY2RTTDBvSHVHVmVHYmxDK3hBMTNvSUhyQ2VrbE5pQkhGN0R2TWVyQgprK1VpWmlOYWFPNUFCMEhsMzZlVDJZdnRxVW1hMThNRG5wdHErQktjU1BxWHRrNGpLZGpxRHJMMUY2SktIYVBLClY0MUVhN2hnMkFiVmtndjhHV1QrUzFxNTd3Z21TY2JUNnNGTVVQWUhIN0NEL1RNQnNJMnJtQjJtaFZrbWFBTHYKanFpNHZ0SnhGSFZxWVdVaDlkczN3R2sxcGt3YzBZMzNiby9KcjkwNEh5aUp5MTNSaFRJMTBOTWN4MjlwcXFGdgpXRGI5b3NPcUwrWVFneHZzL1JMWjZXRzdLeklwYUUvVG8rUEkyWmdmZzBUVTdOZmhITGtiTERxeTd3PT0KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K"
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5VENDQXJHZ0F3SUJBZ0lRZHo3ME1MSmlZQUdvelpsNkpoU3VhVEFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWdGdzB5TURFeU1EVXhPVEUzTVRWYUdBOHlNRFV3TVRJd05URTVNamN4TlZvdwpEVEVMTUFrR0ExVUVBeE1DWTJFd2dnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUUMvCmNNN0kwTHRsTVY3aHBEalZSZWlEUHpuRE8yT3NQeU42VlJzcHVIRU04QzE0Q01oSllWSlo0eCtiTmcwbWNlSnEKYm91V21wd3ZHdm1Ed0NKWE90Z3drZ2pwUzFpVE11RVRDSms2YTVGR3FzMnBTZkg5cm1kVEpLZktqRTN0N3kwOQpmTk9xeGxUZmJJUGVSVCtrWEFIKzJjSFlrbllVVHlNakRHRENpZklaZWV4SXZMTFQ0ODlNb0lmZ2g5ZVFRVUUxCjVYZkdkMVIrdDdKdzhucC9nK2pQS1VZMHp1aDhpYTZCNHNhcnZMd2pOS0QyRGVFc1ZhR29JY1IrR0p1ZUtQcWQKeDY1MCt3S1NQbTg4TEZVbDZxUFF6OUtkSmU5bmYveU1iUE16S2NncXA3SGQxN1M5N29wc1F0eWhRaHorbHFXYgpSaDI1M1M3OG9uQnZTUGo5VVM4MUZjVXRXQVdsZzU1T2dSVTlvZm5NWjRCZVNkMnRjYTdKRnBtS3U4Q3dObWNLCjVrN1ZRbEk0dUJSckNUbFVGVWcyZG16SnkwZVl4S2srMDQ5djhDazAzem5GSlFRa01FdFVpOXVXUEpWUmZ4TEsKbmg4dFl4dFpFeEoraFJ0TDNaejY2ZitwOStrRTNaTng5cWJHZ1BYSEtHU2pQSkVUWThPRGpFUVF6Rk1BcWtpcQo0UUVWTnYxU3ZmdjZ6MGUwWU9UeDZ6RUNEL3ovMk1DRnlvMXQwUTBsdFI2bU8yUTlFbmJPZkZVMGgvRUp5Um9jCkZmNTZST1ovVWZyZGphaWp6c1ZTTlQ2a3VLUk9TNWxoUlVseEpsVmc2dUk1emNIS1VYc2pMZFNhNWpMZWYyWEQKeDY3N1BiTnRRL0tKRlpMS01ZMWY1TmhkOFNhTlJrdEFtUnJweG5KNFZRSURBUUFCb3lNd0lUQU9CZ05WSFE4QgpBZjhFQkFNQ0FxUXdEd1lEVlIwVEFRSC9CQVV3QXdFQi96QU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUFtN3pSClg4dFlheGp0dDJTUGY2bklWT01pSEZJdEpoZXRacDl1c3BvUmhRSHkvRnpVVDcwWWdDaUUvTHlXVjNublE1T08Kc0k5VUpJdEZHbnVPQVh6U3AxTFNEbXJRYTF0K1g3R1R3Vmw5KzVyeXYxN2lCbTVGc0Q5TEZQM2hGTzAwaUlHVgpRNGxScVFGUytjd3VSWmhZUklWTG1TSklXZzZLbnMzUDR2cVJPWUd0N1BRWDg5bm40YlZZVjc1TUVJWjVxdHVhCng5VGxaeXhxSU15ZHdLeEs1bENieE1QMk1oZXkvcjMyUXdseVE2UGdqbVorZ3REcmVvbTJZT2xWL3BuTHVxSEYKRDEwSlhvQ3MvWHdlNUQxT0VwUTVRK0hKNlpqazh0clhJVnpaNHpxWkN6NmNoT21COXJLSnpTSDUrbXRJOVEwNQpEVkdZZEJSM2JzTDFkZ0hnL3NrZjVlb3VpanhZeFZ2ZkRSOWZVeFlleHpuSThaZGxKaDZwUC8zZDM0dzR5UGxqCnpXQS9pMHlTZHc5TUJNSVpQdEY3aGQ3dnZKaEJyTXV0UUlkQnFCdjBJcmk5SktURU9mWm91dlVFQ0VndG55SUoKZy9wMUdkY2habXl3U2RQUjFscXpDcDNYU3grZEZlSWl6UGczK1F5WForQ0V6NGhsM3FBSDBnVEF4N09wZFRmVwpjTEZWcmVZbzJvRGZsZjY5eWg5STBvSVh5VDhBcjFNT2lXTGQvc1VpaWZiZS9TVGhQQjN1WkNPOWJubDVTeS9qCkhEa2VqVTkzS0l4TktzTktQV2N0UkFveWNLMk9qeC8rNDduYmFHK2t1ZmRRellBRll1RS8ySVNmTDA1NnVaeWYKNUdEcnJ2dFNTa0hUZE8rdVYyMzRHQmVtbURmcmNuV3l2WDNNNEJZPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://demo-k8s-40bd920d.hcp.southeastasia.azmk8s.io:443"
              - password               = "d7269e8658b413f6eaf725066c87432535d0a4c68d908478a2c1b4f8b731fdef97082f64f8dd48e922644f3841d2e67dd846f75ee1c2b2aac8550c7ee7023c4f"
              - username               = "clusterAdmin_demo-k8s-rg_demo-k8s"
            },
        ] -> (known after apply)
      ~ kube_admin_config_raw           = (sensitive value)
      ~ kube_config                     = [
          - {
              - client_certificate     = ""
              - client_key             = ""
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5VENDQXJHZ0F3SUJBZ0lRZHo3ME1MSmlZQUdvelpsNkpoU3VhVEFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWdGdzB5TURFeU1EVXhPVEUzTVRWYUdBOHlNRFV3TVRJd05URTVNamN4TlZvdwpEVEVMTUFrR0ExVUVBeE1DWTJFd2dnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUUMvCmNNN0kwTHRsTVY3aHBEalZSZWlEUHpuRE8yT3NQeU42VlJzcHVIRU04QzE0Q01oSllWSlo0eCtiTmcwbWNlSnEKYm91V21wd3ZHdm1Ed0NKWE90Z3drZ2pwUzFpVE11RVRDSms2YTVGR3FzMnBTZkg5cm1kVEpLZktqRTN0N3kwOQpmTk9xeGxUZmJJUGVSVCtrWEFIKzJjSFlrbllVVHlNakRHRENpZklaZWV4SXZMTFQ0ODlNb0lmZ2g5ZVFRVUUxCjVYZkdkMVIrdDdKdzhucC9nK2pQS1VZMHp1aDhpYTZCNHNhcnZMd2pOS0QyRGVFc1ZhR29JY1IrR0p1ZUtQcWQKeDY1MCt3S1NQbTg4TEZVbDZxUFF6OUtkSmU5bmYveU1iUE16S2NncXA3SGQxN1M5N29wc1F0eWhRaHorbHFXYgpSaDI1M1M3OG9uQnZTUGo5VVM4MUZjVXRXQVdsZzU1T2dSVTlvZm5NWjRCZVNkMnRjYTdKRnBtS3U4Q3dObWNLCjVrN1ZRbEk0dUJSckNUbFVGVWcyZG16SnkwZVl4S2srMDQ5djhDazAzem5GSlFRa01FdFVpOXVXUEpWUmZ4TEsKbmg4dFl4dFpFeEoraFJ0TDNaejY2ZitwOStrRTNaTng5cWJHZ1BYSEtHU2pQSkVUWThPRGpFUVF6Rk1BcWtpcQo0UUVWTnYxU3ZmdjZ6MGUwWU9UeDZ6RUNEL3ovMk1DRnlvMXQwUTBsdFI2bU8yUTlFbmJPZkZVMGgvRUp5Um9jCkZmNTZST1ovVWZyZGphaWp6c1ZTTlQ2a3VLUk9TNWxoUlVseEpsVmc2dUk1emNIS1VYc2pMZFNhNWpMZWYyWEQKeDY3N1BiTnRRL0tKRlpMS01ZMWY1TmhkOFNhTlJrdEFtUnJweG5KNFZRSURBUUFCb3lNd0lUQU9CZ05WSFE4QgpBZjhFQkFNQ0FxUXdEd1lEVlIwVEFRSC9CQVV3QXdFQi96QU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUFtN3pSClg4dFlheGp0dDJTUGY2bklWT01pSEZJdEpoZXRacDl1c3BvUmhRSHkvRnpVVDcwWWdDaUUvTHlXVjNublE1T08Kc0k5VUpJdEZHbnVPQVh6U3AxTFNEbXJRYTF0K1g3R1R3Vmw5KzVyeXYxN2lCbTVGc0Q5TEZQM2hGTzAwaUlHVgpRNGxScVFGUytjd3VSWmhZUklWTG1TSklXZzZLbnMzUDR2cVJPWUd0N1BRWDg5bm40YlZZVjc1TUVJWjVxdHVhCng5VGxaeXhxSU15ZHdLeEs1bENieE1QMk1oZXkvcjMyUXdseVE2UGdqbVorZ3REcmVvbTJZT2xWL3BuTHVxSEYKRDEwSlhvQ3MvWHdlNUQxT0VwUTVRK0hKNlpqazh0clhJVnpaNHpxWkN6NmNoT21COXJLSnpTSDUrbXRJOVEwNQpEVkdZZEJSM2JzTDFkZ0hnL3NrZjVlb3VpanhZeFZ2ZkRSOWZVeFlleHpuSThaZGxKaDZwUC8zZDM0dzR5UGxqCnpXQS9pMHlTZHc5TUJNSVpQdEY3aGQ3dnZKaEJyTXV0UUlkQnFCdjBJcmk5SktURU9mWm91dlVFQ0VndG55SUoKZy9wMUdkY2habXl3U2RQUjFscXpDcDNYU3grZEZlSWl6UGczK1F5WForQ0V6NGhsM3FBSDBnVEF4N09wZFRmVwpjTEZWcmVZbzJvRGZsZjY5eWg5STBvSVh5VDhBcjFNT2lXTGQvc1VpaWZiZS9TVGhQQjN1WkNPOWJubDVTeS9qCkhEa2VqVTkzS0l4TktzTktQV2N0UkFveWNLMk9qeC8rNDduYmFHK2t1ZmRRellBRll1RS8ySVNmTDA1NnVaeWYKNUdEcnJ2dFNTa0hUZE8rdVYyMzRHQmVtbURmcmNuV3l2WDNNNEJZPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://demo-k8s-40bd920d.hcp.southeastasia.azmk8s.io:443"
              - password               = ""
              - username               = "clusterUser_demo-k8s-rg_demo-k8s"
            },
        ] -> (known after apply)
      ~ kube_config_raw                 = (sensitive value)
      ~ kubelet_identity                = [
          - {
              - client_id                 = "278c284b-2283-4f1a-9071-893030ce85a5"
              - object_id                 = "c3e392c6-738d-4098-80f1-578852c5a4c3"
              - user_assigned_identity_id = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/MC_demo-k8s-rg_demo-k8s_southeastasia/providers/Microsoft.ManagedIdentity/userAssignedIdentities/demo-k8s-agentpool"
            },
        ] -> (known after apply)
      ~ kubernetes_version              = "1.18.10" -> (known after apply)
        name                            = "demo-k8s"
      ~ node_resource_group             = "MC_demo-k8s-rg_demo-k8s_southeastasia" -> (known after apply)
      ~ private_cluster_enabled         = false -> (known after apply)
      + private_fqdn                    = (known after apply)
      ~ private_link_enabled            = false -> (known after apply)
      - tags                            = {} -> null
        # (4 unchanged attributes hidden)

      ~ addon_profile {
          ~ aci_connector_linux {
                # (1 unchanged attribute hidden)
            }


          ~ http_application_routing {
              ~ enabled                            = true -> false # forces replacement
              ~ http_application_routing_zone_name = "74be71d7e4c8470498a3.southeastasia.aksapp.io" -> (known after apply)
            }


          ~ oms_agent {
              ~ oms_agent_identity         = [
                  - {
                      - client_id                 = "a81a03b4-0b6f-4a1a-9099-32796e9e88cc"
                      - object_id                 = "535472da-392b-47dd-ace9-c22fbba9706a"
                      - user_assigned_identity_id = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/MC_demo-k8s-rg_demo-k8s_southeastasia/providers/Microsoft.ManagedIdentity/userAssignedIdentities/omsagent-demo-k8s"
                    },
                ] -> (known after apply)
                # (2 unchanged attributes hidden)
            }
            # (2 unchanged blocks hidden)
        }

      ~ auto_scaler_profile {
          ~ balance_similar_node_groups      = false -> (known after apply)
          ~ max_graceful_termination_sec     = "600" -> (known after apply)
          ~ scale_down_delay_after_add       = "10m" -> (known after apply)
          ~ scale_down_delay_after_delete    = "10s" -> (known after apply)
          ~ scale_down_delay_after_failure   = "3m" -> (known after apply)
          ~ scale_down_unneeded              = "10m" -> (known after apply)
          ~ scale_down_unready               = "20m" -> (known after apply)
          ~ scale_down_utilization_threshold = "0.5" -> (known after apply)
          ~ scan_interval                    = "10s" -> (known after apply)
        }

      ~ default_node_pool {
          - enable_node_public_ip = false -> null
          ~ max_pods              = 110 -> (known after apply)
            name                  = "system"
          ~ node_count            = 1 -> (known after apply)
          - node_labels           = {} -> null
          - node_taints           = [] -> null
          ~ orchestrator_version  = "1.18.10" -> (known after apply)
          ~ os_disk_size_gb       = 128 -> (known after apply)
          - tags                  = {} -> null
            # (6 unchanged attributes hidden)
        }

      ~ identity {
          ~ principal_id = "20ebb818-b08f-4516-bdbb-2edfaa8e39c1" -> (known after apply)
          ~ tenant_id    = "14485795-c84c-451a-bb0a-1610c5b5f017" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          ~ docker_bridge_cidr = "172.17.0.1/16" -> (known after apply)
          ~ load_balancer_sku  = "Standard" -> "standard"
          + network_policy     = (known after apply)
          ~ pod_cidr           = "10.244.0.0/16" -> (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ load_balancer_profile {
              ~ effective_outbound_ips    = [
                  - "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourceGroups/MC_demo-k8s-rg_demo-k8s_southeastasia/providers/Microsoft.Network/publicIPAddresses/1f7bc92c-f262-4d81-af2d-04e0023bbf07",
                ] -> (known after apply)
              ~ idle_timeout_in_minutes   = 0 -> (known after apply)
              ~ managed_outbound_ip_count = 1 -> (known after apply)
              ~ outbound_ip_address_ids   = [] -> (known after apply)
              ~ outbound_ip_prefix_ids    = [] -> (known after apply)
              ~ outbound_ports_allocated  = 0 -> (known after apply)
            }
        }

      ~ role_based_access_control {
            # (1 unchanged attribute hidden)

          ~ azure_active_directory {
              ~ tenant_id              = "14485795-c84c-451a-bb0a-1610c5b5f017" -> (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster_node_pool.k8s_nodepool_dev must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "k8s_nodepool_dev" {
      - enable_node_public_ip = false -> null
      ~ id                    = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s/agentPools/devtest" -> (known after apply)
      ~ kubernetes_cluster_id = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s" -> (known after apply) # forces replacement
      ~ max_count             = 3 -> 10
      ~ max_pods              = 110 -> (known after apply)
      ~ min_count             = 0 -> 1
        name                  = "devtest"
      ~ node_count            = 1 -> (known after apply)
      - node_labels           = {} -> null
      - node_taints           = [] -> null
      ~ orchestrator_version  = "1.18.10" -> (known after apply)
      ~ os_disk_size_gb       = 128 -> (known after apply)
      - tags                  = {} -> null
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ host        = "https://demo-k8s-40bd920d.hcp.southeastasia.azmk8s.io:443" -> (known after apply)
  ~ id          = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s" -> (known after apply)
  ~ kube_config = <<-EOT
        apiVersion: v1
        clusters:
        - cluster:
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5VENDQXJHZ0F3SUJBZ0lRZHo3ME1MSmlZQUdvelpsNkpoU3VhVEFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWdGdzB5TURFeU1EVXhPVEUzTVRWYUdBOHlNRFV3TVRJd05URTVNamN4TlZvdwpEVEVMTUFrR0ExVUVBeE1DWTJFd2dnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUUMvCmNNN0kwTHRsTVY3aHBEalZSZWlEUHpuRE8yT3NQeU42VlJzcHVIRU04QzE0Q01oSllWSlo0eCtiTmcwbWNlSnEKYm91V21wd3ZHdm1Ed0NKWE90Z3drZ2pwUzFpVE11RVRDSms2YTVGR3FzMnBTZkg5cm1kVEpLZktqRTN0N3kwOQpmTk9xeGxUZmJJUGVSVCtrWEFIKzJjSFlrbllVVHlNakRHRENpZklaZWV4SXZMTFQ0ODlNb0lmZ2g5ZVFRVUUxCjVYZkdkMVIrdDdKdzhucC9nK2pQS1VZMHp1aDhpYTZCNHNhcnZMd2pOS0QyRGVFc1ZhR29JY1IrR0p1ZUtQcWQKeDY1MCt3S1NQbTg4TEZVbDZxUFF6OUtkSmU5bmYveU1iUE16S2NncXA3SGQxN1M5N29wc1F0eWhRaHorbHFXYgpSaDI1M1M3OG9uQnZTUGo5VVM4MUZjVXRXQVdsZzU1T2dSVTlvZm5NWjRCZVNkMnRjYTdKRnBtS3U4Q3dObWNLCjVrN1ZRbEk0dUJSckNUbFVGVWcyZG16SnkwZVl4S2srMDQ5djhDazAzem5GSlFRa01FdFVpOXVXUEpWUmZ4TEsKbmg4dFl4dFpFeEoraFJ0TDNaejY2ZitwOStrRTNaTng5cWJHZ1BYSEtHU2pQSkVUWThPRGpFUVF6Rk1BcWtpcQo0UUVWTnYxU3ZmdjZ6MGUwWU9UeDZ6RUNEL3ovMk1DRnlvMXQwUTBsdFI2bU8yUTlFbmJPZkZVMGgvRUp5Um9jCkZmNTZST1ovVWZyZGphaWp6c1ZTTlQ2a3VLUk9TNWxoUlVseEpsVmc2dUk1emNIS1VYc2pMZFNhNWpMZWYyWEQKeDY3N1BiTnRRL0tKRlpMS01ZMWY1TmhkOFNhTlJrdEFtUnJweG5KNFZRSURBUUFCb3lNd0lUQU9CZ05WSFE4QgpBZjhFQkFNQ0FxUXdEd1lEVlIwVEFRSC9CQVV3QXdFQi96QU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUFtN3pSClg4dFlheGp0dDJTUGY2bklWT01pSEZJdEpoZXRacDl1c3BvUmhRSHkvRnpVVDcwWWdDaUUvTHlXVjNublE1T08Kc0k5VUpJdEZHbnVPQVh6U3AxTFNEbXJRYTF0K1g3R1R3Vmw5KzVyeXYxN2lCbTVGc0Q5TEZQM2hGTzAwaUlHVgpRNGxScVFGUytjd3VSWmhZUklWTG1TSklXZzZLbnMzUDR2cVJPWUd0N1BRWDg5bm40YlZZVjc1TUVJWjVxdHVhCng5VGxaeXhxSU15ZHdLeEs1bENieE1QMk1oZXkvcjMyUXdseVE2UGdqbVorZ3REcmVvbTJZT2xWL3BuTHVxSEYKRDEwSlhvQ3MvWHdlNUQxT0VwUTVRK0hKNlpqazh0clhJVnpaNHpxWkN6NmNoT21COXJLSnpTSDUrbXRJOVEwNQpEVkdZZEJSM2JzTDFkZ0hnL3NrZjVlb3VpanhZeFZ2ZkRSOWZVeFlleHpuSThaZGxKaDZwUC8zZDM0dzR5UGxqCnpXQS9pMHlTZHc5TUJNSVpQdEY3aGQ3dnZKaEJyTXV0UUlkQnFCdjBJcmk5SktURU9mWm91dlVFQ0VndG55SUoKZy9wMUdkY2habXl3U2RQUjFscXpDcDNYU3grZEZlSWl6UGczK1F5WForQ0V6NGhsM3FBSDBnVEF4N09wZFRmVwpjTEZWcmVZbzJvRGZsZjY5eWg5STBvSVh5VDhBcjFNT2lXTGQvc1VpaWZiZS9TVGhQQjN1WkNPOWJubDVTeS9qCkhEa2VqVTkzS0l4TktzTktQV2N0UkFveWNLMk9qeC8rNDduYmFHK2t1ZmRRellBRll1RS8ySVNmTDA1NnVaeWYKNUdEcnJ2dFNTa0hUZE8rdVYyMzRHQmVtbURmcmNuV3l2WDNNNEJZPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
            server: https://demo-k8s-40bd920d.hcp.southeastasia.azmk8s.io:443
          name: demo-k8s
        contexts:
        - context:
            cluster: demo-k8s
            user: clusterUser_demo-k8s-rg_demo-k8s
          name: demo-k8s
        current-context: demo-k8s
        kind: Config
        preferences: {}
        users:
        - name: clusterUser_demo-k8s-rg_demo-k8s
          user:
            auth-provider:
              config:
                apiserver-id: 6dae42f8-4368-4678-94ff-3960e28e3630
                client-id: 80faf920-1908-4b52-b5ef-a8e7bedfc67a
                config-mode: "1"
                environment: AzurePublicCloud
                tenant-id: 14485795-c84c-451a-bb0a-1610c5b5f017
              name: azure
    EOT -> (known after apply)

Warning: Version constraints inside provider configuration blocks are deprecated

  on main.tf line 34, in provider "azurerm":
  34:   version = "~> 2.14.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```
</details>s
*Pusher: @SatyKrish, Action: `pull_request`*